In [32]:
import numpy as np
import pandas as pd
import random

##### 딕셔너리_DataFrame

In [33]:
#데이터 입력
data = {'2020' : [9668465, 3391946, 2942828, 1450062], 
        '2010' : [10312545, 3567910, 2758296, 1454636]}

#1.데이터프레임
df = pd.DataFrame(data)

#2.데이터프레임화 했을 때 나타나는 인덱스 번호를 원하는 이름으로 바꿔주기
df.index=['서울', '부산', '인천', '광주']

# (1+2) -> df = pd.DataFrame(data.index = ['서울', '부산', '인천', '광주'])
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [34]:
#데이터프레임 전치하기
df.T

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

##### 리스트_DataFrame

In [35]:
data2 = [[9668465, 3391946, 2942828, 1450062], [10312545, 3567910, 2758296, 1454636]]

#행
ind = ['2020', '2010']

#열
col = ['서울', '부산', '인천', '광주']

#데이터프레임화 
df2 = pd.DataFrame(data2, index = ind, columns = col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

##### DataFrame 값, 인덱스, 컬럼 확인

In [36]:
#데이터프레임 값 확인
print(df.values)
print("============================================")

#데이터프레임 인덱스 확인
print(df.index)
print("============================================")

#데이터프레임 컬럼 확인
print(df.columns)
print("============================================")

[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]]
============================================
Index(['서울', '부산', '인천', '광주'], dtype='object')
============================================
Index(['2020', '2010'], dtype='object')
============================================

##### DataFrame 인덱싱

In [37]:
df['2020']

서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 2020, dtype: int64

In [38]:
#데이터프레임 형식으로 가져오고 싶을때
df[['2020']]

       2020
서울  9668465
부산  3391946
인천  2942828
광주  1450062

In [39]:
#한개 이상의 데이터를 가져오고 싶을 때
df[['2020', '2010']]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [40]:
#데이터 추가하기
df['2005'] = [9762546, 3512547, 2517680, 1456016]
df

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  1456016

##### DataFrame 행 슬라이싱

In [41]:
df[0:2]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [42]:
df['서울':'부산']

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

##### loc[ ] 인덱서
- 실제 인덱스 이름을 사용하여 행을 가지고 올 때 사용

In [43]:
df.loc['부산':'인천', '2020':'2010']

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

##### iloc[ ] 인덱서
- 인덱스 번호를 사용하여 행을 가지고 올 때 사용

In [44]:
df.iloc[3]

2020    1450062
2010    1454636
2005    1456016
Name: 광주, dtype: int64

In [45]:
df.iloc[1:3, 0:2]

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

##### Pandas Boolean 인덱싱

In [47]:
df['2010']>=2500000

서울     True
부산     True
인천     True
광주    False
Name: 2010, dtype: bool

In [46]:
df[df['2010']>=2500000]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680